In [108]:
#Data Structure in Pandas - Two types  1)Series 2)DataFrame and Panel

#Series - it is one-dimaensional array that is storing varaious data types.
import pandas as pd

In [109]:
# Creating Series with List
abc= [2,4,6,8]  
var = pd.Series(abc)
var

0    2
1    4
2    6
3    8
dtype: int64

In [110]:
#Get specified Value from series
print(var[2])

6

In [111]:
#check type of series
print(type(var))

<class 'pandas.core.series.Series'>

In [112]:
#Change index value
var1 = pd.Series(abc,index=["A","B","C","D"]) 
var1

A    2
B    4
C    6
D    8
dtype: int64

In [113]:
# Change Datatype 
var1.astype('float')

A    2.0
B    4.0
C    6.0
D    8.0
dtype: float64

In [114]:
#Series using Dictonary
dic = {
    "name":['Python','Pandas','Numpy','Java'],
    "pop":[10,20,30,40],
    "rank":[1,4,6,2]
}
ser1 = pd.Series(dic)
ser1

name    [Python, Pandas, Numpy, Java]
pop                  [10, 20, 30, 40]
rank                     [1, 4, 6, 2]
dtype: object

In [115]:
#Binary Operation on Series  .add() & .sub() Function
s1 = pd.Series(10,index=[1,2,3,4,5,6,7]) # Creating Series 1
s2 = pd.Series(20,index=[1,2,3,4]) # creating Series 2
# Addition of 2 series using .add() Binary operation function
res=s1.add(s2)
res

1    30.0
2    30.0
3    30.0
4    30.0
5     NaN
6     NaN
7     NaN
dtype: float64

In [116]:
# Substraction of 2 series using .sub() Binary operation function
res1=s1.sub(s2)
res1

1   -10.0
2   -10.0
3   -10.0
4   -10.0
5     NaN
6     NaN
7     NaN
dtype: float64

In [117]:
#dropna-  remove null values 
res.dropna(inplace=True)
res

1    30.0
2    30.0
3    30.0
4    30.0
dtype: float64

In [118]:
# Combine_first() Method - used to combine two series into one
combine = s2.combine_first(s1)
combine

1    20.0
2    20.0
3    20.0
4    20.0
5    10.0
6    10.0
7    10.0
dtype: float64

In [119]:
#creating series using for loop and list 
ser=pd.Series(range(1,20,3), index=[x for x in 'abcdefg'])
print(ser)

a     1
b     4
c     7
d    10
e    13
f    16
g    19
dtype: int64

In [120]:
# Add one series to another series using append() and concat()
#append()- appends one series objects at the end of another series and returns appended series

a1 = pd.Series([2,4,6,8,10])
a2 = pd.Series([12,14,16,18,20])
#Adding a2 to a1 using append()
append1=a1.append(a2,ignore_index=True)
append1

C:\Users\amits\AppData\Local\Temp\ipykernel_9816\2102478892.py:7: FutureWarning: The series.append method is deprecated and will be removed from pandas in a future version. Use pandas.concat instead.
  append1=a1.append(a2,ignore_index=True)

0     2
1     4
2     6
3     8
4    10
5    12
6    14
7    16
8    18
9    20
dtype: int64

In [121]:
# concatenate two series
con1=pd.concat([a1,a2],axis=1)
con1

    0   1
0   2  12
1   4  14
2   6  16
3   8  18
4  10  20

In [122]:
#add external file 
df1 = pd.read_csv("titanic.csv")
df1

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...,...
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q

In [123]:
# head() - method is used to return specified numbers of rows from beginning of series
df1.head(5)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [124]:
# tail () - method is used to return a specified number of rows from end of a series
df1.tail(5)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.00,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.00,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.45,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.00,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.75,NaN,Q

In [125]:
# Working With Text Data
#str.lower- function returns uppercast to lowercase
low = df1["Name"].str.lower()
low

0                                braund, mr. owen harris
1      cumings, mrs. john bradley (florence briggs th...
2                                 heikkinen, miss. laina
3           futrelle, mrs. jacques heath (lily may peel)
4                               allen, mr. william henry
                             ...
886                                montvila, rev. juozas
887                         graham, miss. margaret edith
888             johnston, miss. catherine helen "carrie"
889                                behr, mr. karl howell
890                                  dooley, mr. patrick
Name: Name, Length: 891, dtype: object

In [126]:
#str.upper - function returns lower case to uppercase
upr = df1["Name"].str.upper()
upr

0                                BRAUND, MR. OWEN HARRIS
1      CUMINGS, MRS. JOHN BRADLEY (FLORENCE BRIGGS TH...
2                                 HEIKKINEN, MISS. LAINA
3           FUTRELLE, MRS. JACQUES HEATH (LILY MAY PEEL)
4                               ALLEN, MR. WILLIAM HENRY
                             ...
886                                MONTVILA, REV. JUOZAS
887                         GRAHAM, MISS. MARGARET EDITH
888             JOHNSTON, MISS. CATHERINE HELEN "CARRIE"
889                                BEHR, MR. KARL HOWELL
890                                  DOOLEY, MR. PATRICK
Name: Name, Length: 891, dtype: object